jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
/*
  ESP32 U-shape robot controller.

  Hardware strategy:
    - No gripper.
    - The U-shape body traps objects inside the robot.
    - Two MG996R servos form the front gate.
    - One DFRobot IR break-beam sensor detects object entry.
    - Default transport batches are 3, 2, 2 objects.

  Serial commands from Jetson:
    PING
    STOP
    SET <fl> <fr> <bl> <br>
    DRIVE <base> <fl_scale> <fr_scale> <bl_scale> <br_scale>
    RUN <base> <fl_scale> <fr_scale> <bl_scale> <br_scale> <duration_ms>
    STRAIGHT <base> <duration_ms>
    ENC? | ENC RESET | ENC ON | ENC OFF | ENC TEST <base> <duration_ms>
    IMU ON | IMU OFF | IMU RESET
    I2C?
    ZERO_YAW
    GATE OPEN | GATE CLOSE | GATE?
    SERVO LEFT <deg> | SERVO RIGHT <deg> | SERVO BOTH <left_deg> <right_deg> | SERVO TEST
    CARGO? | CARGO RESET
    BATCH <0|1|2>
    CAPACITY <1..3>
    AUTO_GATE ON | AUTO_GATE OFF
    CAPTURE_ARM ON | CAPTURE_ARM OFF | CAPTURE_ARM?
    UNLOAD
    HELP
*/

#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_BNO08x.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

#ifndef OUTPUT_OPEN_DRAIN
#define OUTPUT_OPEN_DRAIN OUTPUT
#endif

struct Motor {
  const char *name;
  int pinA;
  int pinB;
  int chA;
  int chB;
  int direction;
  int currentPwm;
  int targetPwm;
};

// Pin map from "pin번호 연결.txt".
Motor motors[] = {
  {"FL", 4, 5, 2, 3, -1, 0, 0},
  {"FR", 23, 25, 0, 1, 1, 0, 0},
  {"BL", 14, 13, 6, 7, -1, 0, 0},
  {"BR", 2, 15, 4, 5, 1, 0, 0},
};

const int MOTOR_COUNT = sizeof(motors) / sizeof(motors[0]);
const int PWM_FREQ_HZ = 20000;
const int PWM_RESOLUTION_BITS = 8;
const int PWM_MAX = 255;
const int MIN_MOVING_PWM = 0;
const int RAMP_STEP = 6;
const int RAMP_DELAY_MS = 6;

const int ENCODER_A_PINS[] = {18, 16, 32, 26};  // FL, FR, BL, BR
const int ENCODER_B_PINS[] = {19, 17, 34, 27};  // GPIO34 is input-only and has no internal pull-up.
const int ENCODER_DIRECTIONS[] = {1, 1, 1, -1};
volatile int32_t encoderTicks[MOTOR_COUNT] = {0, 0, 0, 0};
const uint32_t ENCODER_PRINT_INTERVAL_MS = 50;

const float FIXED_WHEEL_SCALE_FL = 1.17f;
const float FIXED_WHEEL_SCALE_FR = 0.89f;
const float FIXED_WHEEL_SCALE_BL = 1.11f;
const float FIXED_WHEEL_SCALE_BR = 0.89f;

const uint32_t STRAIGHT_CONTROL_INTERVAL_MS = 25;
const float STRAIGHT_WHEEL_KP = 3.5f;
const int STRAIGHT_CORRECTION_DIRECTION = 1;
const bool STRAIGHT_ENABLE_ENCODER_CORRECTION = true;
const int STRAIGHT_MAX_CORRECTION = 35;
const uint32_t STRAIGHT_DEBUG_INTERVAL_MS = 250;

const uint32_t SET_CONTROL_INTERVAL_MS = 25;
const float SET_WHEEL_KP = 3.5f;
const float SET_WHEEL_KI = 0.08f;
const int SET_MAX_CORRECTION = 35;
const float SET_INTEGRAL_LIMIT = 250.0f;
const uint32_t SET_DEBUG_INTERVAL_MS = 250;

const uint32_t SET1_CONTROL_INTERVAL_MS = 25;
const int SET1_STATIC_FRICTION_PWM = 50;
const float SET1_FEED_FORWARD_PWM_PER_CPS = 0.042f;
const float SET1_WHEEL_KP = 0.045f;
const float SET1_WHEEL_KI = 0.35f;
const int SET1_MAX_CORRECTION = 90;
const float SET1_INTEGRAL_LIMIT = 250.0f;
const float SET1_MAX_TARGET_CPS = 5449.0f;  // 50 rad/s * 109.0 counts/rad.
const uint32_t SET1_DEBUG_INTERVAL_MS = 1000;
const bool SET1_IMU_YAW_FEEDBACK_ENABLED = true;
const float SET1_WHEEL_RADIUS_M = 0.033f;
const float SET1_TRACK_WIDTH_M = 0.30f;
const float SET1_ENCODER_COUNTS_PER_REV = 684.8f;
const float SET1_IMU_YAW_RATE_SIGN = 1.0f;
const uint32_t SET1_IMU_YAW_RATE_TIMEOUT_MS = 250;
const float SET1_IMU_YAW_RATE_FILTER_ALPHA = 0.25f;
const float SET1_YAW_FEEDBACK_KP = 1.0f;
const float SET1_YAW_FEEDBACK_KI = 0.0f;
const float SET1_YAW_FEEDBACK_INTEGRAL_LIMIT = 0.5f;
const float SET1_YAW_FEEDBACK_MAX_CORRECTION_RAD_S = 1.00f;
const float SET1_YAW_FEEDBACK_MAX_STEP_RAD_S = 0.20f;
const float SET1_YAW_RATE_ERROR_DEADBAND_RAD_S = 0.02f;

const int I2C_SDA_PIN = 21;
const int I2C_SCL_PIN = 22;
const uint32_t I2C_CLOCK_HZ = 100000;
const uint32_t IMU_STARTUP_SETTLE_MS = 100;
const uint32_t IMU_RETRY_INTERVAL_MS = 1500;
const int IMU_INIT_ATTEMPTS = 3;
const int I2C_RECOVERY_CLOCK_PULSES = 18;
const uint32_t IMU_REPORT_INTERVAL_US = 20000;
const uint32_t IMU_PRINT_INTERVAL_MS = 50;

const int LEFT_GATE_SERVO_PIN = 33;
const int RIGHT_GATE_SERVO_PIN = 12;
const int SERVO_MIN_US = 500;
const int SERVO_MAX_US = 2500;
const int SERVO_PERIOD_US = 20000;
const uint32_t SERVO_HOLD_AFTER_MOVE_MS = 900;

// Tune these four angles on the real gate before driving.
const int LEFT_GATE_CLOSED_DEG = 110;
const int LEFT_GATE_OPEN_DEG = 20;
const int RIGHT_GATE_CLOSED_DEG = 20;
const int RIGHT_GATE_OPEN_DEG = 110;

const int IR_BEAM_PIN = 35;
const bool IR_ACTIVE_LOW = true;  // Most break-beam receivers output LOW when blocked.
const uint32_t IR_DEBOUNCE_MS = 45;
const uint32_t ENTRY_CLOSE_DELAY_MS = 500;
const int IR_CAPTURE_FORWARD_PWM = 70;
const uint32_t IR_CAPTURE_ADVANCE_TIMEOUT_MS = 3000;
const int MAX_CARGO_CAPACITY = 3;
const int BATCH_CAPACITIES[] = {3, 2, 2};
const int BATCH_COUNT = sizeof(BATCH_CAPACITIES) / sizeof(BATCH_CAPACITIES[0]);

String inputLine;
uint32_t lastRampMs = 0;
bool timedRunActive = false;
uint32_t timedRunStopAtMs = 0;
bool setPwmControlActive = false;
uint32_t nextSetControlMs = 0;
uint32_t nextSetDebugMs = 0;
int setBaseTargets[MOTOR_COUNT] = {0, 0, 0, 0};
int32_t setLastTicks[MOTOR_COUNT] = {0, 0, 0, 0};
float setIntegral[MOTOR_COUNT] = {0.0f, 0.0f, 0.0f, 0.0f};
bool set1VelocityControlActive = false;
uint32_t lastSet1ControlMs = 0;
uint32_t nextSet1ControlMs = 0;
uint32_t nextSet1DebugMs = 0;
float set1TargetCps[MOTOR_COUNT] = {0.0f, 0.0f, 0.0f, 0.0f};
float set1Integral[MOTOR_COUNT] = {0.0f, 0.0f, 0.0f, 0.0f};
int32_t set1LastTicks[MOTOR_COUNT] = {0, 0, 0, 0};
float set1YawFeedbackIntegral = 0.0f;
float set1YawCorrectionRadS = 0.0f;
bool straightRunActive = false;
uint32_t straightRunStopAtMs = 0;
uint32_t nextStraightControlMs = 0;
uint32_t nextStraightDebugMs = 0;
int straightBasePwm = 0;
int straightBaseTargets[MOTOR_COUNT] = {0, 0, 0, 0};
int32_t straightLastTicks[MOTOR_COUNT] = {0, 0, 0, 0};
bool encoderStreaming = false;
uint32_t nextEncoderPrintMs = 0;

Adafruit_BNO08x bno08x(-1);
sh2_SensorValue_t sensorValue;
bool imuReady = false;
bool imuStreaming = false;
bool imuRequested = false;
bool haveImuSample = false;
bool haveImuYawRateReference = false;
bool haveImuYawRateSample = false;
uint32_t nextImuPrintMs = 0;
uint32_t latestImuSampleMs = 0;
uint32_t lastYawRateUs = 0;
float yawZeroRad = 0.0f;
float latestYawRad = 0.0f;
float latestImuWzRadS = 0.0f;
float lastYawRateYawRad = 0.0f;
float latestPitchRad = 0.0f;
float latestRollRad = 0.0f;
float latestQi = 0.0f;
float latestQj = 0.0f;
float latestQk = 0.0f;
float latestQr = 1.0f;

bool gateOpen = false;
bool autoGateEnabled = true;
int activeBatchIndex = 0;
int targetCapacity = BATCH_CAPACITIES[0];
int cargoCount = 0;
bool irRawBlocked = false;
bool irStableBlocked = false;
bool countedThisBlock = false;
bool irPendingEntry = false;
bool irCaptureAdvanceActive = false;
bool captureAdvanceArmed = false;
uint32_t irLastRawChangeMs = 0;
uint32_t scheduledGateCloseAtMs = 0;
uint32_t irCaptureAdvanceStartedMs = 0;

struct SoftwareServo {
  int pin;
  int pulseUs;
  bool pulseHigh;
  uint32_t cycleStartUs;
  uint32_t pulseEndUs;
};

SoftwareServo leftGateServo = {LEFT_GATE_SERVO_PIN, 1500, false, 0, 0};
SoftwareServo rightGateServo = {RIGHT_GATE_SERVO_PIN, 1500, false, 0, 0};
bool servosEnabled = false;
uint32_t servosActiveUntilMs = 0;

void setupPwmPin(int pin, int channel, int freqHz, int resolutionBits) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttachChannel(pin, freqHz, resolutionBits, channel);
#else
  ledcSetup(channel, freqHz, resolutionBits);
  ledcAttachPin(pin, channel);
#endif
}

void writePwmChannel(int channel, int duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWriteChannel(channel, duty);
#else
  ledcWrite(channel, duty);
#endif
}

bool isInputOnlyNoPullupPin(int pin) {
  return pin >= 34 && pin <= 39;
}

void IRAM_ATTR updateEncoderFromA(int index) {
  int a = digitalRead(ENCODER_A_PINS[index]);
  int b = digitalRead(ENCODER_B_PINS[index]);
  int delta = (a == b) ? 1 : -1;
  encoderTicks[index] += delta * ENCODER_DIRECTIONS[index];
}

void IRAM_ATTR handleFlEncoderA() {
  updateEncoderFromA(0);
}

void IRAM_ATTR handleFrEncoderA() {
  updateEncoderFromA(1);
}

