jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
void IRAM_ATTR handleBlEncoderA() {
  updateEncoderFromA(2);
}

void IRAM_ATTR handleBrEncoderA() {
  updateEncoderFromA(3);
}

void readEncoderTicks(int32_t *outTicks) {
  noInterrupts();
  for (int i = 0; i < MOTOR_COUNT; i++) {
    outTicks[i] = encoderTicks[i];
  }
  interrupts();
}

void resetEncoderTicks() {
  noInterrupts();
  for (int i = 0; i < MOTOR_COUNT; i++) {
    encoderTicks[i] = 0;
  }
  interrupts();
}

void printEncoderStatus() {
  int32_t ticks[MOTOR_COUNT];
  readEncoderTicks(ticks);

  Serial.print("ENC");
  for (int i = 0; i < MOTOR_COUNT; i++) {
    Serial.print(' ');
    Serial.print(motors[i].name);
    Serial.print('=');
    Serial.print(ticks[i]);
  }
  Serial.println();
}

void updateEncoderStreaming() {
  if (!encoderStreaming) return;
  uint32_t now = millis();
  if ((int32_t)(now - nextEncoderPrintMs) < 0) return;
  nextEncoderPrintMs = now + ENCODER_PRINT_INTERVAL_MS;
  printEncoderStatus();
}

void setupEncoders() {
  for (int i = 0; i < MOTOR_COUNT; i++) {
    pinMode(ENCODER_A_PINS[i], isInputOnlyNoPullupPin(ENCODER_A_PINS[i]) ? INPUT : INPUT_PULLUP);
    pinMode(ENCODER_B_PINS[i], isInputOnlyNoPullupPin(ENCODER_B_PINS[i]) ? INPUT : INPUT_PULLUP);
  }

  attachInterrupt(digitalPinToInterrupt(ENCODER_A_PINS[0]), handleFlEncoderA, CHANGE);
  attachInterrupt(digitalPinToInterrupt(ENCODER_A_PINS[1]), handleFrEncoderA, CHANGE);
  attachInterrupt(digitalPinToInterrupt(ENCODER_A_PINS[2]), handleBlEncoderA, CHANGE);
  attachInterrupt(digitalPinToInterrupt(ENCODER_A_PINS[3]), handleBrEncoderA, CHANGE);
}

int clampPwm(int pwm) {
  if (pwm > PWM_MAX) return PWM_MAX;
  if (pwm < -PWM_MAX) return -PWM_MAX;
  return pwm;
}

int applyMinimumPwm(int pwm) {
  if (pwm == 0 || MIN_MOVING_PWM <= 0) return pwm;
  int sign = pwm > 0 ? 1 : -1;
  int magnitude = abs(pwm);
  if (magnitude < MIN_MOVING_PWM) magnitude = MIN_MOVING_PWM;
  return sign * magnitude;
}

void writeMotorRaw(Motor &motor, int pwm) {
  pwm = clampPwm(applyMinimumPwm(pwm)) * motor.direction;

  if (pwm > 0) {
    writePwmChannel(motor.chA, pwm);
    writePwmChannel(motor.chB, 0);
  } else if (pwm < 0) {
    writePwmChannel(motor.chA, 0);
    writePwmChannel(motor.chB, -pwm);
  } else {
    writePwmChannel(motor.chA, 0);
    writePwmChannel(motor.chB, 0);
  }
}

void updateMotorRamp() {
  uint32_t now = millis();
  if (now - lastRampMs < RAMP_DELAY_MS) return;
  lastRampMs = now;

  for (int i = 0; i < MOTOR_COUNT; i++) {
    Motor &motor = motors[i];
    if (motor.currentPwm == motor.targetPwm) continue;

    int delta = motor.targetPwm - motor.currentPwm;
    if (abs(delta) <= RAMP_STEP) {
      motor.currentPwm = motor.targetPwm;
    } else {
      motor.currentPwm += delta > 0 ? RAMP_STEP : -RAMP_STEP;
    }
    writeMotorRaw(motor, motor.currentPwm);
  }
}

void setAllTargets(int fl, int fr, int bl, int br) {
  int values[] = {fl, fr, bl, br};
  for (int i = 0; i < MOTOR_COUNT; i++) {
    motors[i].targetPwm = clampPwm(values[i]);
  }
}

float clampFloat(float value, float low, float high) {
  if (value < low) return low;
  if (value > high) return high;
  return value;
}

int roundFloatToInt(float value) {
  return value >= 0.0f ? (int)(value + 0.5f) : (int)(value - 0.5f);
}

float fixedWheelScaleForIndex(int index) {
  if (index == 0) return FIXED_WHEEL_SCALE_FL;
  if (index == 1) return FIXED_WHEEL_SCALE_FR;
  if (index == 2) return FIXED_WHEEL_SCALE_BL;
  return FIXED_WHEEL_SCALE_BR;
}

void resetSetPwmControlState() {
  setPwmControlActive = false;
  nextSetControlMs = 0;
  nextSetDebugMs = 0;
  for (int i = 0; i < MOTOR_COUNT; i++) {
    setBaseTargets[i] = 0;
    setLastTicks[i] = 0;
    setIntegral[i] = 0.0f;
  }
}

void resetSet1VelocityControlState() {
  set1VelocityControlActive = false;
  lastSet1ControlMs = 0;
  nextSet1ControlMs = 0;
  nextSet1DebugMs = 0;
  set1YawFeedbackIntegral = 0.0f;
  set1YawCorrectionRadS = 0.0f;
  for (int i = 0; i < MOTOR_COUNT; i++) {
    set1TargetCps[i] = 0.0f;
    set1Integral[i] = 0.0f;
    set1LastTicks[i] = 0;
  }
}

void forceStopAllMotors() {
  timedRunActive = false;
  resetSetPwmControlState();
  resetSet1VelocityControlState();
  straightRunActive = false;
  irCaptureAdvanceActive = false;
  for (int i = 0; i < MOTOR_COUNT; i++) {
    motors[i].targetPwm = 0;
    motors[i].currentPwm = 0;
    writeMotorRaw(motors[i], 0);
  }
}

int32_t absoluteDelta(int32_t current, int32_t previous) {
  int32_t delta = current - previous;
  return delta < 0 ? -delta : delta;
}

void startStraightRun(int basePwm, int durationMs) {
  basePwm = clampPwm(basePwm);
  if (basePwm == 0 || durationMs <= 0) {
    Serial.println("ERR STRAIGHT needs nonzero base and positive duration_ms");
    return;
  }

  timedRunActive = false;
  straightRunActive = true;
  straightBasePwm = basePwm;
  straightRunStopAtMs = millis() + (uint32_t)durationMs;
  nextStraightControlMs = millis() + STRAIGHT_CONTROL_INTERVAL_MS;
  nextStraightDebugMs = millis() + STRAIGHT_DEBUG_INTERVAL_MS;
  readEncoderTicks(straightLastTicks);
  computeScaledWheelPwm(
    basePwm,
    FIXED_WHEEL_SCALE_FL,
    FIXED_WHEEL_SCALE_FR,
    FIXED_WHEEL_SCALE_BL,
    FIXED_WHEEL_SCALE_BR,
    straightBaseTargets[0],
    straightBaseTargets[1],
    straightBaseTargets[2],
    straightBaseTargets[3]
  );
  setAllTargets(
    straightBaseTargets[0],
    straightBaseTargets[1],
    straightBaseTargets[2],
    straightBaseTargets[3]
  );
  Serial.println("OK STRAIGHT");
  printStatus();
}

void applyFixedWheelCompensation(
  int fl,
  int fr,
  int bl,
  int br,
  int &outFl,
  int &outFr,
  int &outBl,
  int &outBr
) {
  outFl = clampPwm((int)(fl * FIXED_WHEEL_SCALE_FL));
  outFr = clampPwm((int)(fr * FIXED_WHEEL_SCALE_FR));
  outBl = clampPwm((int)(bl * FIXED_WHEEL_SCALE_BL));
  outBr = clampPwm((int)(br * FIXED_WHEEL_SCALE_BR));
}

void startSetClosedLoop(int fl, int fr, int bl, int br) {
  timedRunActive = false;
  straightRunActive = false;
  resetSet1VelocityControlState();
  setPwmControlActive = true;
  nextSetControlMs = millis() + SET_CONTROL_INTERVAL_MS;
  nextSetDebugMs = millis() + SET_DEBUG_INTERVAL_MS;

  applyFixedWheelCompensation(
    fl,
    fr,
    bl,
    br,
    setBaseTargets[0],
    setBaseTargets[1],
    setBaseTargets[2],
    setBaseTargets[3]
  );

  readEncoderTicks(setLastTicks);
  for (int i = 0; i < MOTOR_COUNT; i++) {
    setIntegral[i] = 0.0f;
  }

  setAllTargets(
    setBaseTargets[0],
    setBaseTargets[1],
    setBaseTargets[2],
    setBaseTargets[3]
  );
  Serial.println("OK SET");
  printStatus();
}

