jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
void updateSetClosedLoop() {
  if (!setPwmControlActive) return;

  uint32_t now = millis();
  if ((int32_t)(now - nextSetControlMs) < 0) return;
  nextSetControlMs = now + SET_CONTROL_INTERVAL_MS;

  int32_t ticks[MOTOR_COUNT];
  int32_t wheelDelta[MOTOR_COUNT];
  readEncoderTicks(ticks);
  for (int i = 0; i < MOTOR_COUNT; i++) {
    wheelDelta[i] = absoluteDelta(ticks[i], setLastTicks[i]);
    setLastTicks[i] = ticks[i];
  }

  int32_t averageTicks = 0;
  for (int i = 0; i < MOTOR_COUNT; i++) {
    averageTicks += wheelDelta[i];
  }
  averageTicks /= MOTOR_COUNT;

  int wheelPwm[MOTOR_COUNT];
  int wheelCorrection[MOTOR_COUNT];
  for (int i = 0; i < MOTOR_COUNT; i++) {
    int baseSign = setBaseTargets[i] >= 0 ? 1 : -1;
    if (setBaseTargets[i] == 0) {
      baseSign = 0;
    }

    wheelCorrection[i] = 0;
    if (baseSign != 0) {
      int32_t error = averageTicks - wheelDelta[i];
      setIntegral[i] = constrain(
        setIntegral[i] + (float)error,
        -SET_INTEGRAL_LIMIT,
        SET_INTEGRAL_LIMIT
      );
      float correction = error * SET_WHEEL_KP + setIntegral[i] * SET_WHEEL_KI;
      wheelCorrection[i] = constrain(
        (int)correction,
        -SET_MAX_CORRECTION,
        SET_MAX_CORRECTION
      );
    } else {
      setIntegral[i] = 0.0f;
    }

    wheelPwm[i] = clampPwm(setBaseTargets[i] + baseSign * wheelCorrection[i]);
  }

  setAllTargets(wheelPwm[0], wheelPwm[1], wheelPwm[2], wheelPwm[3]);

  if ((int32_t)(now - nextSetDebugMs) >= 0) {
    nextSetDebugMs = now + SET_DEBUG_INTERVAL_MS;
    Serial.print("SET_DBG avg=");
    Serial.print(averageTicks);
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" d");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelDelta[i]);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" base");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(setBaseTargets[i]);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" corr");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelCorrection[i]);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" pwm");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelPwm[i]);
    }
    Serial.println();
  }
}

int set1FeedForwardPwm(int index, float targetCps) {
  if (fabsf(targetCps) < 1.0f) {
    return 0;
  }
  float direction = targetCps > 0.0f ? 1.0f : -1.0f;
  float staticPwm = direction * SET1_STATIC_FRICTION_PWM;
  float velocityPwm = targetCps * SET1_FEED_FORWARD_PWM_PER_CPS;
  float pwm = (staticPwm + velocityPwm) * fixedWheelScaleForIndex(index);
  return clampPwm(roundFloatToInt(pwm));
}

void startSet1VelocityClosedLoop(float flCps, float frCps, float blCps, float brCps) {
  timedRunActive = false;
  straightRunActive = false;
  resetSetPwmControlState();
  set1VelocityControlActive = true;

  float values[] = {flCps, frCps, blCps, brCps};
  for (int i = 0; i < MOTOR_COUNT; i++) {
    set1TargetCps[i] = clampFloat(values[i], -SET1_MAX_TARGET_CPS, SET1_MAX_TARGET_CPS);
    set1Integral[i] = 0.0f;
  }

  uint32_t now = millis();
  lastSet1ControlMs = now;
  nextSet1ControlMs = now + SET1_CONTROL_INTERVAL_MS;
  nextSet1DebugMs = now + SET1_DEBUG_INTERVAL_MS;
  readEncoderTicks(set1LastTicks);

  int initialPwm[MOTOR_COUNT];
  for (int i = 0; i < MOTOR_COUNT; i++) {
    initialPwm[i] = set1FeedForwardPwm(i, set1TargetCps[i]);
  }
  setAllTargets(initialPwm[0], initialPwm[1], initialPwm[2], initialPwm[3]);
  Serial.println("OK SET1");
  printStatus();
}

void updateSet1VelocityClosedLoop() {
  if (!set1VelocityControlActive) return;

  uint32_t now = millis();
  if ((int32_t)(now - nextSet1ControlMs) < 0) return;

  float dtSec = (now - lastSet1ControlMs) * 0.001f;
  if (dtSec <= 0.0f) {
    dtSec = SET1_CONTROL_INTERVAL_MS * 0.001f;
  }
  lastSet1ControlMs = now;
  nextSet1ControlMs = now + SET1_CONTROL_INTERVAL_MS;

  int32_t ticks[MOTOR_COUNT];
  int32_t wheelDelta[MOTOR_COUNT];
  float measuredCps[MOTOR_COUNT];
  readEncoderTicks(ticks);
  for (int i = 0; i < MOTOR_COUNT; i++) {
    wheelDelta[i] = ticks[i] - set1LastTicks[i];
    set1LastTicks[i] = ticks[i];
    measuredCps[i] = (float)wheelDelta[i] / dtSec;
  }

  float adjustedTargetCps[MOTOR_COUNT];
  bool hasWheelTarget = false;
  for (int i = 0; i < MOTOR_COUNT; i++) {
    adjustedTargetCps[i] = set1TargetCps[i];
    if (fabsf(set1TargetCps[i]) >= 1.0f) {
      hasWheelTarget = true;
    }
  }

  float targetWzRadS = yawRateFromWheelCps(set1TargetCps);
  float imuWzRadS = 0.0f;
  float yawErrorRadS = 0.0f;
  float yawCorrectionRadS = 0.0f;
  float yawCorrectionCps = 0.0f;
  bool yawFeedbackActive = false;

  if (SET1_IMU_YAW_FEEDBACK_ENABLED && hasWheelTarget && haveImuYawRateSample) {
    uint32_t imuAgeMs = now - latestImuSampleMs;
    if (imuAgeMs <= SET1_IMU_YAW_RATE_TIMEOUT_MS) {
      imuWzRadS = SET1_IMU_YAW_RATE_SIGN * latestImuWzRadS;
      yawErrorRadS = targetWzRadS - imuWzRadS;
      if (fabsf(yawErrorRadS) < SET1_YAW_RATE_ERROR_DEADBAND_RAD_S) {
        yawErrorRadS = 0.0f;
      }

      set1YawFeedbackIntegral = clampFloat(
        set1YawFeedbackIntegral + yawErrorRadS * dtSec,
        -SET1_YAW_FEEDBACK_INTEGRAL_LIMIT,
        SET1_YAW_FEEDBACK_INTEGRAL_LIMIT
      );
      yawCorrectionRadS = yawErrorRadS * SET1_YAW_FEEDBACK_KP
          + set1YawFeedbackIntegral * SET1_YAW_FEEDBACK_KI;
      yawCorrectionRadS = clampFloat(
        yawCorrectionRadS,
        -SET1_YAW_FEEDBACK_MAX_CORRECTION_RAD_S,
        SET1_YAW_FEEDBACK_MAX_CORRECTION_RAD_S
      );
      float maxStep = SET1_YAW_FEEDBACK_MAX_STEP_RAD_S;
      yawCorrectionRadS = clampFloat(
        yawCorrectionRadS,
        set1YawCorrectionRadS - maxStep,
        set1YawCorrectionRadS + maxStep
      );
      set1YawCorrectionRadS = yawCorrectionRadS;
      yawCorrectionCps = yawRateCorrectionToSideCps(yawCorrectionRadS);

      adjustedTargetCps[0] = clampFloat(set1TargetCps[0] - yawCorrectionCps, -SET1_MAX_TARGET_CPS, SET1_MAX_TARGET_CPS);
      adjustedTargetCps[1] = clampFloat(set1TargetCps[1] + yawCorrectionCps, -SET1_MAX_TARGET_CPS, SET1_MAX_TARGET_CPS);
      adjustedTargetCps[2] = clampFloat(set1TargetCps[2] - yawCorrectionCps, -SET1_MAX_TARGET_CPS, SET1_MAX_TARGET_CPS);
      adjustedTargetCps[3] = clampFloat(set1TargetCps[3] + yawCorrectionCps, -SET1_MAX_TARGET_CPS, SET1_MAX_TARGET_CPS);
      yawFeedbackActive = true;
    } else {
      set1YawFeedbackIntegral = 0.0f;
      set1YawCorrectionRadS = 0.0f;
    }
  } else {
    set1YawFeedbackIntegral = 0.0f;
    set1YawCorrectionRadS = 0.0f;
  }

