jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
  int wheelPwm[MOTOR_COUNT];
  int wheelCorrection[MOTOR_COUNT];
  for (int i = 0; i < MOTOR_COUNT; i++) {
    wheelCorrection[i] = 0;
    if (fabsf(adjustedTargetCps[i]) < 1.0f) {
      set1Integral[i] = 0.0f;
      wheelPwm[i] = 0;
      continue;
    }

    float error = adjustedTargetCps[i] - measuredCps[i];
    set1Integral[i] = clampFloat(
      set1Integral[i] + error * dtSec,
      -SET1_INTEGRAL_LIMIT,
      SET1_INTEGRAL_LIMIT
    );
    float correction = error * SET1_WHEEL_KP + set1Integral[i] * SET1_WHEEL_KI;
    wheelCorrection[i] = constrain(
      roundFloatToInt(correction),
      -SET1_MAX_CORRECTION,
      SET1_MAX_CORRECTION
    );

    int feedForward = set1FeedForwardPwm(i, adjustedTargetCps[i]);
    wheelPwm[i] = clampPwm(feedForward + wheelCorrection[i]);
  }

  setAllTargets(wheelPwm[0], wheelPwm[1], wheelPwm[2], wheelPwm[3]);

  if ((int32_t)(now - nextSet1DebugMs) >= 0) {
    nextSet1DebugMs = now + SET1_DEBUG_INTERVAL_MS;
    Serial.print("SET1_DBG dt=");
    Serial.print(dtSec, 3);
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" target");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(set1TargetCps[i], 1);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" adj");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(adjustedTargetCps[i], 1);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" measured");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(measuredCps[i], 1);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" d");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelDelta[i]);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" corr");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelCorrection[i]);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" pwm");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelPwm[i]);
    }
    Serial.print(" target_wz=");
    Serial.print(targetWzRadS, 3);
    Serial.print(" imu_wz=");
    Serial.print(imuWzRadS, 3);
    Serial.print(" yaw_err=");
    Serial.print(yawErrorRadS, 3);
    Serial.print(" yaw_corr=");
    Serial.print(yawCorrectionRadS, 3);
    Serial.print(" yaw_corr_cps=");
    Serial.print(yawCorrectionCps, 1);
    Serial.print(" yaw_fb=");
    Serial.print(yawFeedbackActive ? 1 : 0);
    Serial.println();
  }
}

void updateStraightRun() {
  if (!straightRunActive) return;

  uint32_t now = millis();
  if ((int32_t)(now - straightRunStopAtMs) >= 0) {
    forceStopAllMotors();
    Serial.println("OK DONE");
    return;
  }

  if ((int32_t)(now - nextStraightControlMs) < 0) return;
  nextStraightControlMs = now + STRAIGHT_CONTROL_INTERVAL_MS;

  int32_t ticks[MOTOR_COUNT];
  int32_t wheelDelta[MOTOR_COUNT];
  readEncoderTicks(ticks);
  for (int i = 0; i < MOTOR_COUNT; i++) {
    wheelDelta[i] = absoluteDelta(ticks[i], straightLastTicks[i]);
    straightLastTicks[i] = ticks[i];
  }

  int32_t averageTicks = 0;
  for (int i = 0; i < MOTOR_COUNT; i++) {
    averageTicks += wheelDelta[i];
  }
  averageTicks /= MOTOR_COUNT;

  int driveSign = straightBasePwm >= 0 ? 1 : -1;
  int wheelPwm[MOTOR_COUNT];
  int wheelCorrection[MOTOR_COUNT];
  for (int i = 0; i < MOTOR_COUNT; i++) {
    wheelCorrection[i] = 0;
    if (STRAIGHT_ENABLE_ENCODER_CORRECTION) {
      int32_t error = averageTicks - wheelDelta[i];
      wheelCorrection[i] = constrain((int)(error * STRAIGHT_WHEEL_KP * STRAIGHT_CORRECTION_DIRECTION), -STRAIGHT_MAX_CORRECTION, STRAIGHT_MAX_CORRECTION);
    }
    wheelPwm[i] = clampPwm(straightBaseTargets[i] + driveSign * wheelCorrection[i]);
  }

  setAllTargets(wheelPwm[0], wheelPwm[1], wheelPwm[2], wheelPwm[3]);

  if ((int32_t)(now - nextStraightDebugMs) >= 0) {
    nextStraightDebugMs = now + STRAIGHT_DEBUG_INTERVAL_MS;
    Serial.print("STRAIGHT_DBG avg=");
    Serial.print(averageTicks);
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" d");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelDelta[i]);
    }
    for (int i = 0; i < MOTOR_COUNT; i++) {
      Serial.print(" pwm");
      Serial.print(motors[i].name);
      Serial.print('=');
      Serial.print(wheelPwm[i]);
    }
    Serial.println();
  }
}

void printStatus() {
  Serial.print("PWM");
  for (int i = 0; i < MOTOR_COUNT; i++) {
    Serial.print(' ');
    Serial.print(motors[i].name);
    Serial.print('=');
    Serial.print(motors[i].currentPwm);
    Serial.print('/');
    Serial.print(motors[i].targetPwm);
  }
  Serial.println();
}

int servoPulseFromAngle(int degrees) {
  degrees = constrain(degrees, 0, 180);
  return map(degrees, 0, 180, SERVO_MIN_US, SERVO_MAX_US);
}

void updateSoftwareServo(SoftwareServo &servo, uint32_t nowUs) {
  if (servo.cycleStartUs == 0 || (int32_t)(nowUs - servo.cycleStartUs) >= SERVO_PERIOD_US) {
    servo.cycleStartUs = nowUs;
    servo.pulseEndUs = nowUs + (uint32_t)servo.pulseUs;
    servo.pulseHigh = true;
    digitalWrite(servo.pin, HIGH);
    return;
  }

  if (servo.pulseHigh && (int32_t)(nowUs - servo.pulseEndUs) >= 0) {
    servo.pulseHigh = false;
    digitalWrite(servo.pin, LOW);
  }
}

void disableServos() {
  servosEnabled = false;
  leftGateServo.pulseHigh = false;
  rightGateServo.pulseHigh = false;
  leftGateServo.cycleStartUs = 0;
  rightGateServo.cycleStartUs = 0;
  digitalWrite(leftGateServo.pin, LOW);
  digitalWrite(rightGateServo.pin, LOW);
}

void armServos(uint32_t holdMs) {
  servosEnabled = true;
  servosActiveUntilMs = millis() + holdMs;
  leftGateServo.cycleStartUs = 0;
  rightGateServo.cycleStartUs = 0;
}

void updateServos() {
  if (!servosEnabled) return;
  if ((int32_t)(millis() - servosActiveUntilMs) >= 0) {
    disableServos();
    return;
  }

  uint32_t nowUs = micros();
  updateSoftwareServo(leftGateServo, nowUs);
  updateSoftwareServo(rightGateServo, nowUs);
}

void holdServos(uint32_t durationMs) {
  armServos(durationMs + 50);
  uint32_t startMs = millis();
  while ((uint32_t)(millis() - startMs) < durationMs) {
    updateServos();
    delay(1);
  }
}

void writeServoAngle(SoftwareServo &servo, int degrees) {
  servo.pulseUs = servoPulseFromAngle(degrees);
  armServos(SERVO_HOLD_AFTER_MOVE_MS);
}

void openGate() {
  writeServoAngle(leftGateServo, LEFT_GATE_OPEN_DEG);
  writeServoAngle(rightGateServo, RIGHT_GATE_OPEN_DEG);
  gateOpen = true;
  scheduledGateCloseAtMs = 0;
  Serial.println("OK GATE OPEN");
}

void closeGate() {
  writeServoAngle(leftGateServo, LEFT_GATE_CLOSED_DEG);
  writeServoAngle(rightGateServo, RIGHT_GATE_CLOSED_DEG);
  gateOpen = false;
  scheduledGateCloseAtMs = 0;
  Serial.println("OK GATE CLOSE");
}

void printCargoStatus() {
  Serial.print("CARGO count=");
  Serial.print(cargoCount);
  Serial.print(" target=");
  Serial.print(targetCapacity);
  Serial.print(" batch=");
  Serial.print(activeBatchIndex);
  Serial.print(" ir_blocked=");
  Serial.print(irStableBlocked ? 1 : 0);
  Serial.print(" capture_armed=");
  Serial.print(captureAdvanceArmed ? 1 : 0);
  Serial.print(" gate=");
  Serial.print(gateOpen ? "open" : "closed");
  Serial.print(" full=");
  Serial.println(cargoCount >= targetCapacity ? 1 : 0);
}

