jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
bool readIrBlockedRaw() {
  int value = digitalRead(IR_BEAM_PIN);
  return IR_ACTIVE_LOW ? (value == LOW) : (value == HIGH);
}

void scheduleGateClose(uint32_t delayMs) {
  if (gateOpen && autoGateEnabled) {
    scheduledGateCloseAtMs = millis() + delayMs;
  }
}

void startIrCaptureAdvance() {
  if (irCaptureAdvanceActive) return;

  timedRunActive = false;
  resetSetPwmControlState();
  resetSet1VelocityControlState();
  straightRunActive = false;

  int fl, fr, bl, br;
  computeScaledWheelPwm(
    IR_CAPTURE_FORWARD_PWM,
    FIXED_WHEEL_SCALE_FL,
    FIXED_WHEEL_SCALE_FR,
    FIXED_WHEEL_SCALE_BL,
    FIXED_WHEEL_SCALE_BR,
    fl,
    fr,
    bl,
    br
  );
  setAllTargets(fl, fr, bl, br);
  irCaptureAdvanceActive = true;
  irCaptureAdvanceStartedMs = millis();
  Serial.println("IR CAPTURE_ADVANCE");
}

void stopIrCaptureAdvance() {
  if (!irCaptureAdvanceActive) return;
  forceStopAllMotors();
  Serial.println("IR CAPTURE_STOP");
}

void setCaptureAdvanceArmed(bool armed, const char *reason) {
  captureAdvanceArmed = armed;
  if (!armed) {
    irPendingEntry = false;
    stopIrCaptureAdvance();
  } else if (irStableBlocked && !irPendingEntry) {
    // If the arm command arrives just after the object breaks the beam, start
    // the same capture sequence without waiting for another IR edge.
    countedThisBlock = true;
    irPendingEntry = true;
    startIrCaptureAdvance();
  }

  Serial.print("OK CAPTURE_ARM ");
  Serial.print(armed ? "ON" : "OFF");
  if (reason != nullptr && reason[0] != '\0') {
    Serial.print(' ');
    Serial.print(reason);
  }
  Serial.println();
}

void registerCargoEntry() {
  if (cargoCount < MAX_CARGO_CAPACITY) {
    cargoCount++;
  }
  Serial.print("EVENT CARGO_ENTRY count=");
  Serial.print(cargoCount);
  Serial.print(" target=");
  Serial.println(targetCapacity);
  scheduleGateClose(ENTRY_CLOSE_DELAY_MS);
}

void updateIrSensor() {
  uint32_t now = millis();
  bool rawBlocked = readIrBlockedRaw();

  if (rawBlocked != irRawBlocked) {
    irRawBlocked = rawBlocked;
    irLastRawChangeMs = now;
  }

  if ((now - irLastRawChangeMs) >= IR_DEBOUNCE_MS && irStableBlocked != irRawBlocked) {
    irStableBlocked = irRawBlocked;
    if (irStableBlocked) {
      Serial.println("IR BLOCKED");
      if (captureAdvanceArmed && !countedThisBlock) {
        countedThisBlock = true;
        irPendingEntry = true;
        startIrCaptureAdvance();
      }
    } else {
      Serial.println("IR CLEAR");
      if (irPendingEntry) {
        stopIrCaptureAdvance();
        registerCargoEntry();
        irPendingEntry = false;
        setCaptureAdvanceArmed(false, "AUTO");
      }
      countedThisBlock = false;
    }
  }

  if (
    irCaptureAdvanceActive &&
    IR_CAPTURE_ADVANCE_TIMEOUT_MS > 0 &&
    (uint32_t)(now - irCaptureAdvanceStartedMs) >= IR_CAPTURE_ADVANCE_TIMEOUT_MS)
  {
    stopIrCaptureAdvance();
    Serial.println("IR CAPTURE_ADVANCE_TIMEOUT");
    // Stop the forced forward motion, but keep irPendingEntry set until the
    // object clears the beam. Clearing it here would discard the BLOCKED ->
    // CLEAR transition, so registerCargoEntry() would never schedule the gate
    // close for an object that takes longer than the advance timeout to pass.
    captureAdvanceArmed = false;
    Serial.println("OK CAPTURE_ARM OFF TIMEOUT");
  }

  if (scheduledGateCloseAtMs != 0 && (int32_t)(now - scheduledGateCloseAtMs) >= 0) {
    closeGate();
  }

  if (cargoCount >= targetCapacity && gateOpen && autoGateEnabled) {
    scheduleGateClose(0);
  }
}

int readIntToken(char *&cursor, bool &ok) {
  while (*cursor == ' ') cursor++;
  if (*cursor == '\0') {
    ok = false;
    return 0;
  }

  char *endPtr = nullptr;
  long value = strtol(cursor, &endPtr, 10);
  if (endPtr == cursor) {
    ok = false;
    return 0;
  }

  cursor = endPtr;
  return (int)value;
}

float readFloatToken(char *&cursor, bool &ok) {
  while (*cursor == ' ') cursor++;
  if (*cursor == '\0') {
    ok = false;
    return 0.0f;
  }

  char *endPtr = nullptr;
  float value = strtof(cursor, &endPtr);
  if (endPtr == cursor) {
    ok = false;
    return 0.0f;
  }

  cursor = endPtr;
  return value;
}

void computeScaledWheelPwm(
  int base,
  float flScale,
  float frScale,
  float blScale,
  float brScale,
  int &fl,
  int &fr,
  int &bl,
  int &br
) {
  (void)flScale;
  (void)frScale;
  (void)blScale;
  (void)brScale;
  fl = clampPwm((int)(base * FIXED_WHEEL_SCALE_FL));
  fr = clampPwm((int)(base * FIXED_WHEEL_SCALE_FR));
  bl = clampPwm((int)(base * FIXED_WHEEL_SCALE_BL));
  br = clampPwm((int)(base * FIXED_WHEEL_SCALE_BR));
}

float wrapPi(float angle) {
  while (angle > PI) angle -= TWO_PI;
  while (angle < -PI) angle += TWO_PI;
  return angle;
}

float cpsToRadPerSec(float countsPerSec) {
  return countsPerSec * TWO_PI / SET1_ENCODER_COUNTS_PER_REV;
}

float radPerSecToCps(float radPerSec) {
  return radPerSec * SET1_ENCODER_COUNTS_PER_REV / TWO_PI;
}

float yawRateFromWheelCps(const float *wheelCps) {
  float leftRadS = 0.5f * (cpsToRadPerSec(wheelCps[0]) + cpsToRadPerSec(wheelCps[2]));
  float rightRadS = 0.5f * (cpsToRadPerSec(wheelCps[1]) + cpsToRadPerSec(wheelCps[3]));
  return (rightRadS - leftRadS) * SET1_WHEEL_RADIUS_M / SET1_TRACK_WIDTH_M;
}

float yawRateCorrectionToSideCps(float yawRateCorrectionRadS) {
  float sideRadS = yawRateCorrectionRadS * SET1_TRACK_WIDTH_M / (2.0f * SET1_WHEEL_RADIUS_M);
  return radPerSecToCps(sideRadS);
}

void resetImuYawRateEstimator() {
  haveImuYawRateReference = false;
  haveImuYawRateSample = false;
  latestImuWzRadS = 0.0f;
  lastYawRateUs = micros();
  lastYawRateYawRad = latestYawRad;
}

void updateImuYawRate(float yawRad) {
  uint32_t nowUs = micros();

  if (!haveImuYawRateReference) {
    lastYawRateYawRad = yawRad;
    lastYawRateUs = nowUs;
    latestImuWzRadS = 0.0f;
    haveImuYawRateReference = true;
    haveImuYawRateSample = false;
    return;
  }

  float dtSec = (nowUs - lastYawRateUs) * 1.0e-6f;
  if (dtSec <= 0.001f) {
    return;
  }

  float measuredWzRadS = wrapPi(yawRad - lastYawRateYawRad) / dtSec;
  if (haveImuYawRateSample) {
    latestImuWzRadS += SET1_IMU_YAW_RATE_FILTER_ALPHA * (measuredWzRadS - latestImuWzRadS);
  } else {
    latestImuWzRadS = measuredWzRadS;
  }
  lastYawRateYawRad = yawRad;
  lastYawRateUs = nowUs;
  latestImuSampleMs = millis();
  haveImuYawRateSample = true;
}

void quatToEuler(float qr, float qi, float qj, float qk, float &yaw, float &pitch, float &roll) {
  float sinrCosp = 2.0f * (qr * qi + qj * qk);
  float cosrCosp = 1.0f - 2.0f * (qi * qi + qj * qj);
  roll = atan2f(sinrCosp, cosrCosp);

  float sinp = 2.0f * (qr * qj - qk * qi);
  if (sinp > 1.0f) sinp = 1.0f;
  if (sinp < -1.0f) sinp = -1.0f;
  pitch = asinf(sinp);

  float sinyCosp = 2.0f * (qr * qk + qi * qj);
  float cosyCosp = 1.0f - 2.0f * (qj * qj + qk * qk);
  yaw = atan2f(sinyCosp, cosyCosp);
}

bool enableRotationVector() {
  if (!bno08x.enableReport(SH2_ROTATION_VECTOR, IMU_REPORT_INTERVAL_US)) {
    Serial.println("WARN IMU rotation vector report failed");
    return false;
  }
  return true;
}

