jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
uint32_t lastImuRetryMs = 0;

void beginI2cBus() {
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(I2C_CLOCK_HZ);
}

void resetImuRuntimeState(bool keepRequest) {
  imuReady = false;
  imuStreaming = false;
  haveImuSample = false;
  haveImuYawRateReference = false;
  haveImuYawRateSample = false;
  latestImuSampleMs = 0;
  lastYawRateUs = 0;
  yawZeroRad = 0.0f;
  latestYawRad = 0.0f;
  latestImuWzRadS = 0.0f;
  latestPitchRad = 0.0f;
  latestRollRad = 0.0f;
  latestQi = 0.0f;
  latestQj = 0.0f;
  latestQk = 0.0f;
  latestQr = 1.0f;
  if (!keepRequest) {
    imuRequested = false;
  }
}

void recoverI2cBus() {
  Wire.end();
  delay(2);

  pinMode(I2C_SDA_PIN, INPUT_PULLUP);
  pinMode(I2C_SCL_PIN, INPUT_PULLUP);
  delay(2);

  pinMode(I2C_SCL_PIN, OUTPUT_OPEN_DRAIN);
  digitalWrite(I2C_SCL_PIN, HIGH);
  for (int i = 0; i < I2C_RECOVERY_CLOCK_PULSES; i++) {
    digitalWrite(I2C_SCL_PIN, LOW);
    delayMicroseconds(8);
    digitalWrite(I2C_SCL_PIN, HIGH);
    delayMicroseconds(8);
  }

  pinMode(I2C_SDA_PIN, OUTPUT_OPEN_DRAIN);
  digitalWrite(I2C_SDA_PIN, LOW);
  delayMicroseconds(8);
  digitalWrite(I2C_SCL_PIN, HIGH);
  delayMicroseconds(8);
  digitalWrite(I2C_SDA_PIN, HIGH);
  delayMicroseconds(8);

  beginI2cBus();
  delay(20);
}

void printI2cScan() {
  int found = 0;
  Serial.print("I2C");
  for (uint8_t address = 1; address < 127; address++) {
    Wire.beginTransmission(address);
    uint8_t error = Wire.endTransmission();
    if (error == 0) {
      Serial.print(" 0x");
      if (address < 16) Serial.print('0');
      Serial.print(address, HEX);
      found++;
    }
  }
  if (found == 0) {
    Serial.print(" none");
  }
  Serial.println();
}

bool beginBno08xI2c() {
  const uint8_t addresses[] = {BNO08x_I2CADDR_DEFAULT, 0x4B};
  const int addressCount = sizeof(addresses) / sizeof(addresses[0]);

  for (int attempt = 0; attempt < IMU_INIT_ATTEMPTS; attempt++) {
    if (attempt > 0) {
      recoverI2cBus();
    }
    for (int i = 0; i < addressCount; i++) {
      const uint8_t address = addresses[i];
      if (bno08x.begin_I2C(address, &Wire)) {
        Serial.print("OK IMU I2C addr=0x");
        if (address < 16) Serial.print('0');
        Serial.println(address, HEX);
        return true;
      }
      delay(20);
    }
  }
  return false;
}

bool initializeImu(bool keepRequest) {
  resetImuRuntimeState(keepRequest);
  recoverI2cBus();
  if (!beginBno08xI2c()) {
    Serial.println("WARN IMU not found");
    return false;
  }

  imuReady = enableRotationVector();
  if (!imuReady) {
    return false;
  }

  Serial.println("OK IMU READY");
  if (imuRequested) {
    imuStreaming = true;
    nextImuPrintMs = millis();
    Serial.println("OK IMU ON");
  }
  return true;
}

void setupImu() {
  beginI2cBus();
  delay(IMU_STARTUP_SETTLE_MS);

  initializeImu(false);
}

void updateImu() {
  if (!imuReady) {
    if (millis() - lastImuRetryMs >= IMU_RETRY_INTERVAL_MS) {
      lastImuRetryMs = millis();
      initializeImu(true);
    }
    return;
  }

  if (bno08x.wasReset()) {
    enableRotationVector();
    resetImuYawRateEstimator();
  }

  if (bno08x.getSensorEvent(&sensorValue) && sensorValue.sensorId == SH2_ROTATION_VECTOR) {
    latestQr = sensorValue.un.rotationVector.real;
    latestQi = sensorValue.un.rotationVector.i;
    latestQj = sensorValue.un.rotationVector.j;
    latestQk = sensorValue.un.rotationVector.k;

    float yawRaw = 0.0f;
    quatToEuler(latestQr, latestQi, latestQj, latestQk, yawRaw, latestPitchRad, latestRollRad);
    if (!haveImuSample) {
      yawZeroRad = yawRaw;
    }
    latestYawRad = wrapPi(yawRaw - yawZeroRad);
    updateImuYawRate(latestYawRad);
    haveImuSample = true;
  }

  uint32_t now = millis();
  if (imuStreaming && haveImuSample && now >= nextImuPrintMs) {
    nextImuPrintMs = now + IMU_PRINT_INTERVAL_MS;
    Serial.print("IMU ");
    Serial.print(now);
    Serial.print(' ');
    Serial.print(latestYawRad, 6);
    Serial.print(' ');
    Serial.print(latestPitchRad, 6);
    Serial.print(' ');
    Serial.print(latestRollRad, 6);
    Serial.print(' ');
    Serial.print(latestQi, 6);
    Serial.print(' ');
    Serial.print(latestQj, 6);
    Serial.print(' ');
    Serial.print(latestQk, 6);
    Serial.print(' ');
    Serial.println(latestQr, 6);
  }
}

void uppercaseToken(char *token) {
  for (char *p = token; *p != '\0'; p++) {
    *p = toupper(*p);
  }
}

void handleGateCommand(char *&cursor) {
  char *mode = strtok_r(cursor, " ", &cursor);
  if (mode == nullptr) {
    Serial.println("ERR GATE needs: GATE OPEN|CLOSE|?");
    return;
  }
  uppercaseToken(mode);
  if (strcmp(mode, "OPEN") == 0) {
    openGate();
    return;
  }
  if (strcmp(mode, "CLOSE") == 0) {
    closeGate();
    return;
  }
  if (strcmp(mode, "?") == 0 || strcmp(mode, "STATUS") == 0) {
    printCargoStatus();
    return;
  }
  Serial.println("ERR GATE needs: GATE OPEN|CLOSE|?");
}

void handleCargoCommand(char *&cursor) {
  char *mode = strtok_r(cursor, " ", &cursor);
  if (mode == nullptr || strcmp(mode, "?") == 0) {
    printCargoStatus();
    return;
  }
  uppercaseToken(mode);
  if (strcmp(mode, "RESET") == 0) {
    setCaptureAdvanceArmed(false, "CARGO_RESET");
    cargoCount = 0;
    countedThisBlock = false;
    Serial.println("OK CARGO RESET");
    printCargoStatus();
    return;
  }
  Serial.println("ERR CARGO needs: CARGO? | CARGO RESET");
}

void handleBatchCommand(char *&cursor) {
  bool ok = true;
  int batchIndex = readIntToken(cursor, ok);
  if (!ok || batchIndex < 0 || batchIndex >= BATCH_COUNT) {
    Serial.println("ERR BATCH needs 0, 1, or 2");
    return;
  }
  activeBatchIndex = batchIndex;
  targetCapacity = BATCH_CAPACITIES[batchIndex];
  setCaptureAdvanceArmed(false, "BATCH");
  cargoCount = 0;
  countedThisBlock = false;
  closeGate();
  Serial.println("OK BATCH");
  printCargoStatus();
}

void handleCapacityCommand(char *&cursor) {
  bool ok = true;
  int value = readIntToken(cursor, ok);
  if (!ok || value < 1 || value > MAX_CARGO_CAPACITY) {
    Serial.println("ERR CAPACITY needs 1..3");
    return;
  }
  targetCapacity = value;
  Serial.println("OK CAPACITY");
  printCargoStatus();
}

void handleAutoGateCommand(char *&cursor) {
  char *mode = strtok_r(cursor, " ", &cursor);
  if (mode == nullptr) {
    Serial.println("ERR AUTO_GATE needs ON|OFF");
    return;
  }
  uppercaseToken(mode);
  if (strcmp(mode, "ON") == 0) {
    autoGateEnabled = true;
    Serial.println("OK AUTO_GATE ON");
    return;
  }
  if (strcmp(mode, "OFF") == 0) {
    autoGateEnabled = false;
    scheduledGateCloseAtMs = 0;
    Serial.println("OK AUTO_GATE OFF");
    return;
  }
  Serial.println("ERR AUTO_GATE needs ON|OFF");
}

void handleCaptureArmCommand(char *&cursor) {
  char *mode = strtok_r(cursor, " ", &cursor);
  if (mode == nullptr) {
    Serial.println("ERR CAPTURE_ARM needs ON|OFF|?");
    return;
  }
  uppercaseToken(mode);
  if (strcmp(mode, "ON") == 0) {
    setCaptureAdvanceArmed(true, "HOST");
    return;
  }
  if (strcmp(mode, "OFF") == 0) {
    setCaptureAdvanceArmed(false, "HOST");
    return;
  }
  if (strcmp(mode, "?") == 0 || strcmp(mode, "STATUS") == 0) {
    printCargoStatus();
    return;
  }
  Serial.println("ERR CAPTURE_ARM needs ON|OFF|?");
}

void handleServoCommand(char *&cursor) {
  char *mode = strtok_r(cursor, " ", &cursor);
  if (mode == nullptr) {
    Serial.println("ERR SERVO needs: LEFT <deg> | RIGHT <deg> | BOTH <left_deg> <right_deg> | TEST");
    return;
  }
  uppercaseToken(mode);

  if (strcmp(mode, "LEFT") == 0) {
    bool ok = true;
    int degrees = readIntToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR SERVO LEFT needs degree 0..180");
      return;
    }
    degrees = constrain(degrees, 0, 180);
    writeServoAngle(leftGateServo, degrees);
    Serial.print("OK SERVO LEFT ");
    Serial.println(degrees);
    return;
  }

  if (strcmp(mode, "RIGHT") == 0) {
    bool ok = true;
    int degrees = readIntToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR SERVO RIGHT needs degree 0..180");
      return;
    }
    degrees = constrain(degrees, 0, 180);
    writeServoAngle(rightGateServo, degrees);
    Serial.print("OK SERVO RIGHT ");
    Serial.println(degrees);
    return;
  }

  if (strcmp(mode, "BOTH") == 0) {
    bool ok = true;
    int leftDegrees = readIntToken(cursor, ok);
    int rightDegrees = readIntToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR SERVO BOTH needs: BOTH <left_deg> <right_deg>");
      return;
    }
    leftDegrees = constrain(leftDegrees, 0, 180);
    rightDegrees = constrain(rightDegrees, 0, 180);
    writeServoAngle(leftGateServo, leftDegrees);
    writeServoAngle(rightGateServo, rightDegrees);
    Serial.print("OK SERVO BOTH L=");
    Serial.print(leftDegrees);
    Serial.print(" R=");
    Serial.println(rightDegrees);
    return;
  }

