jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
  if (strcmp(mode, "TEST") == 0) {
    Serial.println("OK SERVO TEST close -> open -> center -> close");
    closeGate();
    holdServos(700);
    openGate();
    holdServos(700);
    writeServoAngle(leftGateServo, 90);
    writeServoAngle(rightGateServo, 90);
    Serial.println("OK SERVO BOTH L=90 R=90");
    holdServos(700);
    closeGate();
    return;
  }

  Serial.println("ERR SERVO needs: LEFT <deg> | RIGHT <deg> | BOTH <left_deg> <right_deg> | TEST");
}

void setSingleMotorTarget(int motorIndex, int pwm) {
  int values[MOTOR_COUNT] = {0, 0, 0, 0};
  values[motorIndex] = clampPwm(pwm);
  setAllTargets(values[0], values[1], values[2], values[3]);
}

void serviceRobotFor(uint32_t durationMs) {
  uint32_t startMs = millis();
  while ((uint32_t)(millis() - startMs) < durationMs) {
    updateMotorRamp();
    updateServos();
    updateImu();
    updateIrSensor();
    delay(1);
  }
}

void printEncoderTestResult(const char *motorName, int32_t *ticks) {
  Serial.print("ENC_TEST motor=");
  Serial.print(motorName);
  for (int i = 0; i < MOTOR_COUNT; i++) {
    Serial.print(' ');
    Serial.print(motors[i].name);
    Serial.print('=');
    Serial.print(ticks[i]);
  }
  Serial.println();
}

void runEncoderMappingTest(int basePwm, int durationMs) {
  basePwm = clampPwm(basePwm);
  if (basePwm == 0 || durationMs <= 0) {
    Serial.println("ERR ENC TEST needs nonzero base and positive duration_ms");
    return;
  }

  Serial.println("OK ENC TEST");
  for (int i = 0; i < MOTOR_COUNT; i++) {
    forceStopAllMotors();
    serviceRobotFor(250);
    resetEncoderTicks();
    setSingleMotorTarget(i, basePwm);
    serviceRobotFor((uint32_t)durationMs);
    forceStopAllMotors();
    serviceRobotFor(250);

    int32_t ticks[MOTOR_COUNT];
    readEncoderTicks(ticks);
    printEncoderTestResult(motors[i].name, ticks);
  }
  resetEncoderTicks();
  Serial.println("OK ENC TEST DONE");
}

void handleEncoderCommand(char *&cursor) {
  char *mode = strtok_r(cursor, " ", &cursor);
  if (mode == nullptr || strcmp(mode, "?") == 0) {
    printEncoderStatus();
    return;
  }

  uppercaseToken(mode);
  if (strcmp(mode, "RESET") == 0) {
    resetEncoderTicks();
    Serial.println("OK ENC RESET");
    printEncoderStatus();
    return;
  }

  if (strcmp(mode, "ON") == 0) {
    encoderStreaming = true;
    nextEncoderPrintMs = millis();
    Serial.println("OK ENC ON");
    return;
  }

  if (strcmp(mode, "OFF") == 0) {
    encoderStreaming = false;
    Serial.println("OK ENC OFF");
    return;
  }

  if (strcmp(mode, "TEST") == 0) {
    bool ok = true;
    int base = readIntToken(cursor, ok);
    int durationMs = readIntToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR ENC TEST needs: ENC TEST <base> <duration_ms>");
      return;
    }
    runEncoderMappingTest(base, durationMs);
    return;
  }

  Serial.println("ERR ENC needs: ENC? | ENC RESET | ENC ON | ENC OFF | ENC TEST <base> <duration_ms>");
}

void handleCommand(String line) {
  line.trim();
  if (line.length() == 0) return;

  char buffer[192];
  line.toCharArray(buffer, sizeof(buffer));
  char *cursor = buffer;
  char *command = strtok_r(cursor, " ", &cursor);
  if (command == nullptr) return;
  uppercaseToken(command);

  if (strcmp(command, "PING") == 0) {
    Serial.println("PONG");
    return;
  }

  if (strcmp(command, "STOP") == 0) {
    setCaptureAdvanceArmed(false, "STOP");
    countedThisBlock = false;
    forceStopAllMotors();
    Serial.println("OK STOP");
    return;
  }

  if (strcmp(command, "SET") == 0) {
    if (irPendingEntry) return;

    bool ok = true;
    int fl = readIntToken(cursor, ok);
    int fr = readIntToken(cursor, ok);
    int bl = readIntToken(cursor, ok);
    int br = readIntToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR SET needs: SET <fl> <fr> <bl> <br>");
      return;
    }

    timedRunActive = false;
    straightRunActive = false;
    startSetClosedLoop(fl, fr, bl, br);
    return;
  }

  if (strcmp(command, "SET1") == 0) {
    if (irPendingEntry) return;

    bool ok = true;
    float fl = readFloatToken(cursor, ok);
    float fr = readFloatToken(cursor, ok);
    float bl = readFloatToken(cursor, ok);
    float br = readFloatToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR SET1 needs: SET1 <fl_cps> <fr_cps> <bl_cps> <br_cps>");
      return;
    }

    startSet1VelocityClosedLoop(fl, fr, bl, br);
    return;
  }

  if (strcmp(command, "DRIVE") == 0 || strcmp(command, "RUN") == 0) {
    if (irPendingEntry) return;

    bool ok = true;
    int base = readIntToken(cursor, ok);
    float flScale = readFloatToken(cursor, ok);
    float frScale = readFloatToken(cursor, ok);
    float blScale = readFloatToken(cursor, ok);
    float brScale = readFloatToken(cursor, ok);
    int durationMs = 0;
    if (strcmp(command, "RUN") == 0) {
      durationMs = readIntToken(cursor, ok);
    }
    if (!ok) {
      Serial.println("ERR DRIVE/RUN needs: DRIVE <base> <fl_s> <fr_s> <bl_s> <br_s>");
      return;
    }

    resetSetPwmControlState();
    resetSet1VelocityControlState();
    int fl, fr, bl, br;
    computeScaledWheelPwm(base, flScale, frScale, blScale, brScale, fl, fr, bl, br);
    straightRunActive = false;
    setAllTargets(fl, fr, bl, br);

    timedRunActive = strcmp(command, "RUN") == 0;
    timedRunStopAtMs = millis() + (uint32_t)durationMs;
    Serial.println(timedRunActive ? "OK RUN" : "OK DRIVE");
    printStatus();
    return;
  }

  if (strcmp(command, "STRAIGHT") == 0) {
    if (irPendingEntry) return;

    bool ok = true;
    int base = readIntToken(cursor, ok);
    int durationMs = readIntToken(cursor, ok);
    if (!ok) {
      Serial.println("ERR STRAIGHT needs: STRAIGHT <base> <duration_ms>");
      return;
    }

    resetSetPwmControlState();
    resetSet1VelocityControlState();
    startStraightRun(base, durationMs);
    return;
  }

  if (strcmp(command, "ENC?") == 0) {
    printEncoderStatus();
    return;
  }

  if (strcmp(command, "ENC") == 0) {
    handleEncoderCommand(cursor);
    return;
  }

  if (strcmp(command, "I2C?") == 0) {
    recoverI2cBus();
    printI2cScan();
    return;
  }

  if (strcmp(command, "I2C") == 0) {
    char *mode = strtok_r(cursor, " ", &cursor);
    if (mode == nullptr) {
      Serial.println("ERR I2C needs: I2C SCAN");
      return;
    }
    uppercaseToken(mode);
    if (strcmp(mode, "SCAN") == 0) {
      recoverI2cBus();
      printI2cScan();
      return;
    }
    Serial.println("ERR I2C needs: I2C SCAN");
    return;
  }

