jwchoi521/SNU_Robot_AI_Challenge/firmware/esp32_u_shape_robot/esp32_u_shape_robot.ino
  if (strcmp(command, "IMU") == 0) {
    char *mode = strtok_r(cursor, " ", &cursor);
    if (mode == nullptr) {
      Serial.println("ERR IMU needs: IMU ON|OFF|RESET");
      return;
    }
    uppercaseToken(mode);
    if (strcmp(mode, "ON") == 0) {
      imuRequested = true;
      if (!imuReady) {
        initializeImu(true);
      }
      imuStreaming = imuReady;
      nextImuPrintMs = millis();
      Serial.println(imuReady ? "OK IMU ON" : "ERR IMU not ready");
      return;
    }
    if (strcmp(mode, "OFF") == 0) {
      imuRequested = false;
      imuStreaming = false;
      Serial.println("OK IMU OFF");
      return;
    }
    if (strcmp(mode, "RESET") == 0) {
      imuRequested = true;
      Serial.println("OK IMU RESET");
      initializeImu(true);
      if (!imuReady) {
        Serial.println("ERR IMU not ready");
      }
      return;
    }
    Serial.println("ERR IMU needs: IMU ON|OFF|RESET");
    return;
  }

  if (strcmp(command, "ZERO_YAW") == 0) {
    if (haveImuSample) {
      yawZeroRad += latestYawRad;
      latestYawRad = 0.0f;
      resetImuYawRateEstimator();
    }
    Serial.println("OK ZERO_YAW");
    return;
  }

  if (strcmp(command, "GATE") == 0) {
    handleGateCommand(cursor);
    return;
  }

  if (strcmp(command, "SERVO") == 0) {
    handleServoCommand(cursor);
    return;
  }

  if (strcmp(command, "CARGO?") == 0) {
    printCargoStatus();
    return;
  }

  if (strcmp(command, "CARGO") == 0) {
    handleCargoCommand(cursor);
    return;
  }

  if (strcmp(command, "BATCH") == 0) {
    handleBatchCommand(cursor);
    return;
  }

  if (strcmp(command, "CAPACITY") == 0) {
    handleCapacityCommand(cursor);
    return;
  }

  if (strcmp(command, "AUTO_GATE") == 0) {
    handleAutoGateCommand(cursor);
    return;
  }

  if (strcmp(command, "CAPTURE_ARM?") == 0) {
    printCargoStatus();
    return;
  }

  if (strcmp(command, "CAPTURE_ARM") == 0) {
    handleCaptureArmCommand(cursor);
    return;
  }

  if (strcmp(command, "UNLOAD") == 0) {
    setCaptureAdvanceArmed(false, "UNLOAD");
    openGate();
    cargoCount = 0;
    countedThisBlock = false;
    Serial.println("OK UNLOAD");
    printCargoStatus();
    return;
  }

  if (strcmp(command, "HELP") == 0) {
    Serial.println("Commands: PING | STOP | SET <fl> <fr> <bl> <br> (fixed+PI) | SET1 <fl_cps> <fr_cps> <bl_cps> <br_cps> | DRIVE <base> <fl_s> <fr_s> <bl_s> <br_s> | RUN <base> <fl_s> <fr_s> <bl_s> <br_s> <ms> | STRAIGHT <base> <ms> | ENC? | ENC RESET | ENC ON|OFF | ENC TEST <base> <ms> | IMU ON|OFF|RESET | I2C? | ZERO_YAW | GATE OPEN|CLOSE|? | SERVO LEFT <deg> | SERVO RIGHT <deg> | SERVO BOTH <left_deg> <right_deg> | SERVO TEST | CARGO? | CARGO RESET | BATCH <0|1|2> | CAPACITY <1..3> | AUTO_GATE ON|OFF | CAPTURE_ARM ON|OFF|? | UNLOAD");
    return;
  }

  Serial.println("ERR unknown command. Send HELP.");
}

void readSerialCommands() {
  while (Serial.available() > 0) {
    char c = (char)Serial.read();
    if (c == '\n' || c == '\r') {
      if (inputLine.length() > 0) {
        handleCommand(inputLine);
        inputLine = "";
      }
    } else {
      inputLine += c;
      if (inputLine.length() > 180) {
        inputLine = "";
        Serial.println("ERR line too long");
      }
    }
  }
}

void setup() {
  Serial.begin(115200);
  delay(800);

  for (int i = 0; i < MOTOR_COUNT; i++) {
    setupPwmPin(motors[i].pinA, motors[i].chA, PWM_FREQ_HZ, PWM_RESOLUTION_BITS);
    setupPwmPin(motors[i].pinB, motors[i].chB, PWM_FREQ_HZ, PWM_RESOLUTION_BITS);
    writeMotorRaw(motors[i], 0);
  }
  setupEncoders();

  // Bring up the BNO08x before gate servos draw startup current.
  setupImu();

  pinMode(LEFT_GATE_SERVO_PIN, OUTPUT);
  pinMode(RIGHT_GATE_SERVO_PIN, OUTPUT);
  digitalWrite(LEFT_GATE_SERVO_PIN, LOW);
  digitalWrite(RIGHT_GATE_SERVO_PIN, LOW);
  closeGate();
  holdServos(1500);

  pinMode(IR_BEAM_PIN, INPUT);
  irRawBlocked = readIrBlockedRaw();
  irStableBlocked = irRawBlocked;
  irLastRawChangeMs = millis();

  Serial.println("ESP32 U-shape robot ready. Send HELP.");
  printCargoStatus();
}

void loop() {
  readSerialCommands();
  updateSet1VelocityClosedLoop();
  updateSetClosedLoop();
  updateStraightRun();
  updateMotorRamp();
  updateServos();
  updateImu();
  updateIrSensor();
  updateEncoderStreaming();

  if (timedRunActive && (int32_t)(millis() - timedRunStopAtMs) >= 0) {
    forceStopAllMotors();
    Serial.println("OK DONE");
  }
}
